package test

import (
	"context"
	"testing"

	"github.com/nbio/st"
)

func TestCountryDescriptionRequest_Ok(t *testing.T) {
	testRequest("countrydescription_response_example.xml", false)
	defer gockOff()

	data, err := acApi.CountryDescriptionRequest(context.Background(), 9)
	er := getCustomErrorType()
	st.Expect(t, err, er)
	st.Expect(t, data.Code, 9)
	st.Expect(t, data.Name, "Россия")
	st.Expect(t, data.Description, "Полное наименование: Российская Федерация - Россия Форма правления: демократическое федеральное государство с республиканской формой правления Географическое положение: в двух континентах - восточной части Европы и северной части Азии Площадь: 17,075 млн. кв. км Население: 146,3 млн. чел.(2000),русские - 81%,татары - 3,8%,украинцы - 3% Столица: Москва - 8,39 млн. чел.(1999) Крупные города: Санкт-Петербург - 4,73 млн. чел., Новосибирск - 1,4 млн. чел., Нижний Новгород - 1,36 млн. чел., Екатеринбург - 1,27 млн. чел.; другие города с населением более 1 млн. чел. - Самара, Омск, Челябинск, Казань, Пермь, Уфа, Ростов-на-Дону, Волгоград (1999) Основные языки: русский (государственный), украинский, белорусский, татарский, армянский и др. - всего более 100 языков Религия: православные, мусульмане, протестанты, католики, иудеи, буддисты Климат: от морского на крайнем северо - западе до резко континентального в сибире и муссонного на Дальнем Востоке Средняя температура: января: от -50С до 0С; июля: от -1С до +26С Денежная единица: рубль Местное время: зимнее: от GMT+2 (Калининград) до GMT+12 (Петропаловск - Камчатский); летнее: от GMT+3 до GMT+13 Национальные праздники: 9 мая - День Победы (1945); 12 июня - День принятия Декларации о государственном суверенитете (1990); 7 ноября - День согласия и примерения (1996); 12 декабря - День Конституции (1993) Основные достопримечательности: свыше 100 заповедников и национальных парков, реки Волга, Обь, Енисей, Лена, Амур, озеро Байкал, курортные зоны на Черном море, горные вершины Большого Кавказа и курорты Кавказских Минеральнх Вод, Телецкое озеро на Алтае, гейзеры и вулканы Камчатки; в Москве: Кремль, Красная прощадь, мавзолей В.Ленина, Оружейная Палата, собор Василия Блаженного, Третьяковская галерея, Бородинская панорама, музей Андрея Рублева, музей изобразительных искусств имени А.Пушкина, усадебные ансамбли-музеи Кусково, Коломенское, Останкино, Царицыно, Архангельское; в Санкт-Петербурге: Эрмитаж, Русский музей, Исаакиевский собор, Петропавловская крепость, Александро-Невская лавра, музей антропологии и этнографии (Кунсткамера), дворцово-парковые ансамбли Петергоф, Павлоск,Царское село (Пушкин), Гатчина; древнерусские города \"Золотого Кольца\": Переславль-Залесский, Ростов Великий, Ярославль, Кострома, Суздаль, Владимир, Сергиев Посад, Юрьев; историко-архитектурный музей-заповедник в Смоленске, кремль и дворец Ивана Грозного в Вологде, музей деревянного зодчества в Кижи, кремль и другие исторические памятники Великого Новгорода, Соловецкий крепость-монастырь на Белом море, Псково-Печорский монастырь и музей-заповедник \"Пушкинские горы\" в Пскове, кремль в Казани, историко-архитектурный музей-заповедник в Тобольске, музей-панорама \"Сталинградская битва\" (1942 ) в Волгограде")
	st.Expect(t, data.Position.Latitude, "61.7731")
	st.Expect(t, data.Position.Longitude, "93.8672")
}

func TestCountryDescriptionRequest_Error(t *testing.T) {
	testRequest("countrydescription_error_example.xml", true)
	defer gockOff()

	_, err := acApi.CountryDescriptionRequest(context.Background(), 9)

	st.Expect(t, err.Code, "9998")
	st.Expect(t, err.Message, "Доступ запрещен !")
}
